#region ...

// TODO: Головне завдання: Реалізувати в найпростішому наближенні можливість використання екземплярів вашого класу аналогічно екземплярів класу List <T>

// TODO: 1) Створіть клас з ім'ям MyList і реалізуйте його від інтерфейсу MList <T>. Натисніть F6. З якими проблемами ви зіткнулися? Зробіть відповідні виправлення.
// TODO: 2) В тілі класу MyList, необхідно створити порожній масив елементів типу Т з ім'ям array і ініціалізуйте йому - null.
// TODO: 3) Створіть конструктор за замовчуванням. У тілі конструктора, створіть масив елементів типу Т розмірністю в 0 елементів і присвойте його в масив array
// TODO: 4) Реалізуйте властивість Count з базового інтерфейсу, вона повинна повертати кількість елементів масиву array
// TODO: 5) Реалізуйте метод Add з базового інтерфейсу. При виклику даного методу, масив array повинен збільшуватися на 1 елемент і в його останній елемент має записуватися значення аргументу методу
// Для тих хто уважний! Щоб впоратися з цим завданням. У тілі методу створіть "проміжний" масив з ім'ям arr розміром на 1 елемент більше ніж масив array тобто T [] arr = new T [array.Lenght + 1]; Використовуйте метод CopyTo, для того, щоб скопіювати всі дані записані в вашому масиві array в масив arr - array.CopyTo (arr, 0); або реалізуйте це копіювання через цикл for. Надайте значення масиву arr масиву array: array = arr; Тепер залишилося тільки дописати аргумент методу Add в останній елемент масиву array: array [array.Lenght-1] = a;
// TODO: 6) Реалізуйте індексатор з базового інтерфейсу, він повинен повертати значення елемента масиву array за вказаним індексом
// TODO: 7) Реалізуйте метод Clear з базового інтерфейсу, він повинен скидати (очищати) масив array в первинний стан, тобто робити його порожнім що складається з 0 елементів.
// TODO: 8) Реалізуйте метод Contains, який повинен позваляет вам знаходити елемент масиву array за вказаним значенням і якщо такий елемент є повертати true інакше false.
// Для реалізації цього завдання, в тілі методу створіть цикл for, який порівнює значення кожного елемента масиву array зі значенням аргументу методу item, і якщо дані значення буде знайдено користувач отримає true: if (array [i] == item) return true; Якщо цикл відпрацював, а шукане значення так і не було знайдено, тоді (тому що всі гілки коду повинні повертати значення) return false;
// TODO: 9) перевизначити метод ToString () з базового класу Object таким чином, щоб при його виклику, можна було побачити детальну інформацію про вашому масиві: його розмір і всі елементи. Тобто Припустимо ви в тілі методу Main створили еклемпляр класу MyList з ім'ям userList, заповнили його значеннями, через виклик методу Add, а далі просто написали Console.WriteLine (userList);

#endregion

namespace GenericsHW
{
    interface MyList<T>
    {
        void Add(T a);
        T this[int index] { get; }
        int Count { get; }
        void Clear();
        bool Contains(T item);
    }
}